In [1]:
import pandas as pd

In [3]:
nobel = pd.read_json("./data/prize.json")

In [4]:
nobel.head()

                                              prizes
0  {'year': '2022', 'category': 'chemistry', 'lau...
1  {'year': '2022', 'category': 'economics', 'lau...
2  {'year': '2022', 'category': 'literature', 'la...
3  {'year': '2022', 'category': 'peace', 'laureat...
4  {'year': '2022', 'category': 'physics', 'laure...

In [5]:
nobel.loc[2, "prizes"]

{'year': '2022',
 'category': 'literature',
 'laureates': [{'id': '1017',
   'firstname': 'Annie',
   'surname': 'Ernaux',
   'motivation': '"for the courage and clinical acuity with which she uncovers the roots, estrangements and  collective restraints of personal memory"',
   'share': '1'}]}

In [ ]:
chemistry_2019 = nobel.loc[0, "prizes"]
chemistry_2019

In [7]:
pd.json_normalize(data = chemistry_2019)

   year   category                                          laureates
0  2022  chemistry  [{'id': '1015', 'firstname': 'Carolyn', 'surna...

In [8]:
pd.json_normalize(data = chemistry_2019, record_path = "laureates")

,id,firstname,surname,motivation,share
0,1015,Carolyn,Bertozzi,"""for the development of click chemistry and bi...",3
1,1016,Morten,Meldal,"""for the development of click chemistry and bi...",3
2,743,Barry,Sharpless,"""for the development of click chemistry and bi...",3

In [11]:
chemistry = pd.json_normalize(
 data = chemistry_2019,
 record_path = "laureates",
 meta = ["year", "category"],
 )

chemistry

,id,firstname,surname,motivation,share,year,category
0,1015,Carolyn,Bertozzi,"""for the development of click chemistry and bi...",3,2022,chemistry
1,1016,Morten,Meldal,"""for the development of click chemistry and bi...",3,2022,chemistry
2,743,Barry,Sharpless,"""for the development of click chemistry and bi...",3,2022,chemistry

In [12]:
chemistry.to_csv(
 "./data/demo_chemistry.csv",
 index = False,
 columns = ["id", "firstname", "surname", "category"]
 )

In [13]:
pd.read_excel("./data/excel/Single Worksheet.xlsx")

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [14]:
pd.read_excel(
 io = "./data/excel/Single Worksheet.xlsx",
 usecols = ["City", "First Name", "Last Name"],
 index_col = "City"
 )

              First Name Last Name
City
Miami            Brandon     James
Denver              Sean   Hawkins
Los Angeles         Judy       Day
San Francisco     Ashley      Ruiz
Portland       Stephanie     Gomez

In [16]:
pd.read_excel("./data/excel/Multiple Worksheets.xlsx")

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [21]:
#pd.read_excel("./data/excel/Multiple Worksheets.xlsx", sheet_name = 0)
pd.read_excel("./data/excel/Multiple Worksheets.xlsx", sheet_name = "Data 1")

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [22]:
workbook = pd.read_excel(
 "./data/excel/Multiple Worksheets.xlsx", sheet_name = None
 )

workbook

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F,
 'Data 3':   First Name  Last Name     City Gender
 0     Robert     Miller  Seattle      M
 1       Tara     Garcia  Phoenix      F
 2    Raphael  Rodriguez  Orlando      M}

In [24]:
workbook["Data 3"]

  First Name  Last Name     City Gender
0     Robert     Miller  Seattle      M
1       Tara     Garcia  Phoenix      F
2    Raphael  Rodriguez  Orlando      M